//Временска прогноза
//За различни градови дадени се мерењата на температурата (степени Целзиусови)
//во одредени временски интервали. Ваша задача е за даден град да се прикаже
//листа од сите температурни мерења. Притоа, ако се случи при внес два интервали да се исти,
//тогаш се зема средната вредност од измерените температури во интервалите.
//Влез: Во првиот ред од влезот е даден броjот на мерења 𝑁 (𝑁 <= 10000),
//а во секоj нареден ред е даден прво градот, потоа почеток на интервал, краj на
//интервал и температурата разделени со празно место. Во последниот ред е даден
//градот за коj треба да се испечати соодветнота информациjа.
//Излез: Листата од мерењата за даден град. Да се испечати во следниов формат:
//G:
//HH:MM – XX:YY Z
//HH:MM – XX:YY Z
//...
//каде што G е градот, HH:MM e почетокот на интервалот, XX:YY е краjот на
//интервалот, а Z e температурата во степени Целзиусови.
//Пример 1:
//Влез:
//4
//Ohrid 10:00 12:00 23.1
//Skopje 09:00 10:30 24
//Ohrid 12:00 13:00 25
//Skopje 10:00 11:00 26.2
//Ohrid
//Излез:
//Ohrid:
//10:00 - 12:00 23.10
//12:00 - 13:00 25.00
//Пример 2:
//Влез:
//4
//Ohrid 10:00 12:00 23.1
//Skopje 09:00 10:30 24
//Ohrid 12:00 13:00 25
//Skopje 10:00 11:00 26.2
//Strumica
//Излез:
//Strumica: does not exist

package HashTables.CBHT.Zadaci;

public class WeatherForecast {


}
