//За даден текст на англиски jазик, потребно е да се направи проверка дали е
//        правилно напишан, односно дали правилно се напишани зборовите. За таа цел
//прво се внесува речник на зборови (односно листа на зборови кои ги содржи
//        англискиот jазик), а потоа е даден текст. Како резултат треба да се испечатат
//сите зборови кои се неправилно напишани или ги нема во речникот.

//Влез: Прво е даден броj 𝑁 на поими кои ´ке ги содржи речникот, а во наредните 𝑁 реда се дадени зборовите кои ги содржи англискиот jазик. Потоа е даден
//текст, коj треба да се провери дали е правилно напишан.
//Излез: Се печати листа на зборови кои се неправилно напишани (секоj во
//посебен ред). Доколку сите зборови се добро напишани се печати: Bravo.
//Забелешка: Треба да се игнорираат интерпункциски знаци како точка (.),
//запирка (,), извичник (!) и прашалник (?). Исто така, да се внимава на голема и
//мала буква, односно иако зборовите во речникот се со мали букви, во реченица
//може да поjават со голема почетна буква и притоа се сметаат за точни. Треба
//да се одреди броjот на „кофички” и хеш функциjата.
//Пример:
//Влез:
// 4
//where
//is
//my
//cat
//Where is my Ccat?
//Излез:
//Ccat


package HashTables.OBHT.Zadaci;



